app/controllers/conversations_controller.rb

SELECT "users".* FROM "users"
SELECT "conversations".* FROM "conversations"
---
  def index
    @users = User.all
    @conversations = Conversation.all

SELECT  1 AS one FROM "conversations" WHERE ("conversations"."sender_id" = 3 AND "conversations"."recipient_id" = 2) LIMIT 1
SELECT "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '3' AND conversations.recipient_id ='2') OR (conversations.sender_id = '2' AND conversations.recipient_id ='3'))
INSERT INTO "conversations" ("sender_id", "recipient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sender_id", 3], ["recipient_id", 2], ["created_at", "2016-10-10 14:00:39.646917"], ["updated_at", "2016-10-10 14:00:39.646917"]]
---
  def create
    if Conversation.between(params[:sender_id],params[:recipient_id]).present?
      @conversation = Conversation.between(params[:sender_id], params[:recipient_id]).first
    else
      @conversation = Conversation.create!(conversation_params)