app/controllers/livros_controller.rb

  def index
    @livros = Livro.all
---
SELECT "livros".* FROM "livros"

  def resultado
    @livros = Livro.search(params[:query])
---
SELECT "livros".* FROM "livros" WHERE (nome LIKE '%redes%')

  def show
    @livro = Livro.find(params[:id])
---
SELECT  "livros".* FROM "livros" WHERE "livros"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @livro = Livro.new(livro_params)
      if @livro.save
---
INSERT INTO "livros" ("nome", "autor", "isbn", "descricao", "publicacao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @livro.destroy
---
DELETE FROM "livros" WHERE "livros"."id" = ?  [["id", 2]]

    def set_livro
      @livro = Livro.find(params[:id])
---
SELECT  "livros".* FROM "livros" WHERE "livros"."id" = ? LIMIT 1  [["id", 2]]